black-ghost-off/ESP32-BLE-Controller/BleController.cpp
#include "BleController.h"
#include "BleConnectionStatus.h"
#include "BleControllerConfiguration.h"
#include "BleKeyboardKeys.h"
#include "HIDTypes.h"
#include "NimBLEHIDDevice.h"
#include "NimBLELog.h"
#include "sdkconfig.h"
#include <NimBLEDevice.h>
#include <NimBLEServer.h>
#include <NimBLEUtils.h>

#include <stdexcept>

#if defined(CONFIG_ARDUHAL_ESP_LOG)
#include "esp32-hal-log.h"
#define LOG_TAG "BleController"
#else
#include "esp_log.h"
static const char *LOG_TAG = "BleController";
#endif

#define SERVICE_UUID_DEVICE_INFORMATION "180A" // Service - Device information

#define CHARACTERISTIC_UUID_MODEL_NUMBER                                       \
  "2A24" // Characteristic - Model Number String - 0x2A24
#define CHARACTERISTIC_UUID_SOFTWARE_REVISION                                  \
  "2A28" // Characteristic - Software Revision String - 0x2A28
#define CHARACTERISTIC_UUID_SERIAL_NUMBER                                      \
  "2A25" // Characteristic - Serial Number String - 0x2A25
#define CHARACTERISTIC_UUID_FIRMWARE_REVISION                                  \
  "2A26" // Characteristic - Firmware Revision String - 0x2A26
#define CHARACTERISTIC_UUID_HARDWARE_REVISION                                  \
  "2A27" // Characteristic - Hardware Revision String - 0x2A27
#define CHARACTERISTIC_UUID_BATTERY_POWER_STATE                                \
  "2A1A" // Characteristic - Battery Power State - 0x2A1A

#define POWER_STATE_UNKNOWN 0         // 0b00
#define POWER_STATE_NOT_SUPPORTED 1   // 0b01
#define POWER_STATE_NOT_PRESENT 2     // 0b10
#define POWER_STATE_NOT_DISCHARGING 2 // 0b10
#define POWER_STATE_NOT_CHARGING 2    // 0b10
#define POWER_STATE_GOOD 2            // 0b10
#define POWER_STATE_PRESENT 3         // 0b11
#define POWER_STATE_DISCHARGING 3     // 0b11
#define POWER_STATE_CHARGING 3        // 0b11
#define POWER_STATE_CRITICAL 3        // 0b11

#if BLE_GAMEPAD_DEBUG == 1
static void dumpHIDReport(const uint8_t *report, size_t len);
#endif

BleController::BleController(std::string deviceName, std::string deviceManufacturer,
                       uint8_t batteryLevel, bool delayAdvertising)
    : _buttons(), _specialButtons(0), _x(0), _y(0), _z(0), _rX(0), _rY(0),
      _rZ(0), _slider1(0), _slider2(0), _rudder(0), _throttle(0),
      _accelerator(0), _brake(0), _steering(0), _hat1(0), _hat2(0), _hat3(0),
      _hat4(0), _gX(0), _gY(0), _gZ(0), _aX(0), _aY(0), _aZ(0),
      _batteryPowerInformation(0), _dischargingState(0), _chargingState(0),
      _powerLevel(0), hid(0), pCharacteristic_Power_State(0), configuration(),
      pServer(nullptr), nus(nullptr) {
  this->resetButtons();
  this->deviceName = deviceName;
  this->deviceManufacturer = deviceManufacturer;
  this->batteryLevel = batteryLevel;
  this->delayAdvertising = delayAdvertising;
  this->connectionStatus = new BleConnectionStatus();

  // Initialize keyboard and mouse reports
  memset(&_keyboardReport, 0, sizeof(_keyboardReport));
  memset(&_mouseReport, 0, sizeof(_mouseReport));

  hidReportDescriptorSize = 0;
  hidReportSize = 0;
  numOfButtonBytes = 0;
  enableOutputReport = false;
  outputReportLength = 64;
  nusInitialized = false;
}

void BleController::resetButtons() { memset(&_buttons, 0, sizeof(_buttons)); }

void BleController::begin(BleControllerConfiguration *config) {
  configuration =
      *config; // we make a copy, so the user can't change actual values midway
               // through operation, without calling the begin function again

  enableOutputReport = configuration.getEnableOutputReport();
  outputReportLength = configuration.getOutputReportLength();

  uint8_t buttonPaddingBits = 8 - (configuration.getButtonCount() % 8);
  if (buttonPaddingBits == 8) {
    buttonPaddingBits = 0;
  }
  uint8_t specialButtonPaddingBits =
      8 - (configuration.getTotalSpecialButtonCount() % 8);
  if (specialButtonPaddingBits == 8) {
    specialButtonPaddingBits = 0;
  }
  uint8_t numOfAxisBytes = configuration.getAxisCount() * 2;
  uint8_t numOfSimulationBytes = configuration.getSimulationCount() * 2;

  numOfButtonBytes = configuration.getButtonCount() / 8;
  if (buttonPaddingBits > 0) {
    numOfButtonBytes++;
  }

  uint8_t numOfSpecialButtonBytes =
      configuration.getTotalSpecialButtonCount() / 8;
  if (specialButtonPaddingBits > 0) {
    numOfSpecialButtonBytes++;
  }

  uint8_t numOfMotionBytes = 0;
  if (configuration.getIncludeAccelerometer()) {
    numOfMotionBytes += 6;
  }

  if (configuration.getIncludeGyroscope()) {
    numOfMotionBytes += 6;
  }

  hidReportSize = numOfButtonBytes + numOfSpecialButtonBytes + numOfAxisBytes +
                  numOfSimulationBytes + numOfMotionBytes +
                  configuration.getHatSwitchCount();

  // USAGE_PAGE (Generic Desktop)
  tempHidReportDescriptor[hidReportDescriptorSize++] = 0x05;
  tempHidReportDescriptor[hidReportDescriptorSize++] = 0x01;

  // USAGE (Joystick - 0x04; Gamepad - 0x05; Multi-axis Controller - 0x08)
  tempHidReportDescriptor[hidReportDescriptorSize++] = 0x09;
  tempHidReportDescriptor[hidReportDescriptorSize++] =
      configuration.getControllerType();

  // COLLECTION (Application)
  tempHidReportDescriptor[hidReportDescriptorSize++] = 0xa1;
  tempHidReportDescriptor[hidReportDescriptorSize++] = 0x01;

  // REPORT_ID (Default: 3)
  tempHidReportDescriptor[hidReportDescriptorSize++] = 0x85;
  tempHidReportDescriptor[hidReportDescriptorSize++] =
      configuration.getHidReportId();

  if (configuration.getButtonCount() > 0) {
    // USAGE_PAGE (Button)
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x05;
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x09;

    // LOGICAL_MINIMUM (0)
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x15;
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x00;

    // LOGICAL_MAXIMUM (1)
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x25;
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x01;

    // REPORT_SIZE (1)
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x75;
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x01;

