black-ghost-off/ESP32-BLE-Controller/BleController.cpp
  // INPUT (Const,Var,Abs) - Padding
  tempHidReportDescriptor[hidReportDescriptorSize++] = 0x81;
  tempHidReportDescriptor[hidReportDescriptorSize++] = 0x03;

  // USAGE_PAGE (Generic Desktop)
  tempHidReportDescriptor[hidReportDescriptorSize++] = 0x05;
  tempHidReportDescriptor[hidReportDescriptorSize++] = 0x01;

  // USAGE (X)
  tempHidReportDescriptor[hidReportDescriptorSize++] = 0x09;
  tempHidReportDescriptor[hidReportDescriptorSize++] = 0x30;

  // USAGE (Y)
  tempHidReportDescriptor[hidReportDescriptorSize++] = 0x09;
  tempHidReportDescriptor[hidReportDescriptorSize++] = 0x31;

  // LOGICAL_MINIMUM (-127)
  tempHidReportDescriptor[hidReportDescriptorSize++] = 0x15;
  tempHidReportDescriptor[hidReportDescriptorSize++] = 0x81;

  // LOGICAL_MAXIMUM (127)
  tempHidReportDescriptor[hidReportDescriptorSize++] = 0x25;
  tempHidReportDescriptor[hidReportDescriptorSize++] = 0x7f;

  // REPORT_SIZE (8)
  tempHidReportDescriptor[hidReportDescriptorSize++] = 0x75;
  tempHidReportDescriptor[hidReportDescriptorSize++] = 0x08;

  // REPORT_COUNT (2)
  tempHidReportDescriptor[hidReportDescriptorSize++] = 0x95;
  tempHidReportDescriptor[hidReportDescriptorSize++] = 0x02;

  // INPUT (Data,Var,Rel)
  tempHidReportDescriptor[hidReportDescriptorSize++] = 0x81;
  tempHidReportDescriptor[hidReportDescriptorSize++] = 0x06;

  // USAGE (Wheel)
  tempHidReportDescriptor[hidReportDescriptorSize++] = 0x09;
  tempHidReportDescriptor[hidReportDescriptorSize++] = 0x38;

  // LOGICAL_MINIMUM (-127)
  tempHidReportDescriptor[hidReportDescriptorSize++] = 0x15;
  tempHidReportDescriptor[hidReportDescriptorSize++] = 0x81;

  // LOGICAL_MAXIMUM (127)
  tempHidReportDescriptor[hidReportDescriptorSize++] = 0x25;
  tempHidReportDescriptor[hidReportDescriptorSize++] = 0x7f;

  // REPORT_SIZE (8)
  tempHidReportDescriptor[hidReportDescriptorSize++] = 0x75;
  tempHidReportDescriptor[hidReportDescriptorSize++] = 0x08;

  // REPORT_COUNT (1)
  tempHidReportDescriptor[hidReportDescriptorSize++] = 0x95;
  tempHidReportDescriptor[hidReportDescriptorSize++] = 0x01;

  // INPUT (Data,Var,Rel)
  tempHidReportDescriptor[hidReportDescriptorSize++] = 0x81;
  tempHidReportDescriptor[hidReportDescriptorSize++] = 0x06;

  // END_COLLECTION (Physical) - End mouse pointer collection
  tempHidReportDescriptor[hidReportDescriptorSize++] = 0xc0;

  // END_COLLECTION (Application) - End mouse collection
  tempHidReportDescriptor[hidReportDescriptorSize++] = 0xc0;

  // Set task priority from 5 to 1 in order to get ESP32-C3 working
  xTaskCreate(this->taskServer, "server", 20000, (void *)this, 1, NULL);
}

void BleController::end(void) {}

void BleController::setAxes(int16_t x, int16_t y, int16_t z, int16_t rX,
                         int16_t rY, int16_t rZ, int16_t slider1,
                         int16_t slider2) {
  if (x == -32768) {
    x = -32767;
  }
  if (y == -32768) {
    y = -32767;
  }
  if (z == -32768) {
    z = -32767;
  }
  if (rZ == -32768) {
    rZ = -32767;
  }
  if (rX == -32768) {
    rX = -32767;
  }
  if (rY == -32768) {
    rY = -32767;
  }
  if (slider1 == -32768) {
    slider1 = -32767;
  }
  if (slider2 == -32768) {
    slider2 = -32767;
  }

  _x = x;
  _y = y;
  _z = z;
  _rZ = rZ;
  _rX = rX;
  _rY = rY;
  _slider1 = slider1;
  _slider2 = slider2;

  if (configuration.getAutoReport()) {
    sendReport();
  }
}

void BleController::setHIDAxes(int16_t x, int16_t y, int16_t z, int16_t rZ,
                            int16_t rX, int16_t rY, int16_t slider1,
                            int16_t slider2) {
  if (x == -32768) {
    x = -32767;
  }
  if (y == -32768) {
    y = -32767;
  }
  if (z == -32768) {
    z = -32767;
  }
  if (rZ == -32768) {
    rZ = -32767;
  }
  if (rX == -32768) {
    rX = -32767;
  }
  if (rY == -32768) {
    rY = -32767;
  }
  if (slider1 == -32768) {
    slider1 = -32767;
  }
  if (slider2 == -32768) {
    slider2 = -32767;
  }

  _x = x;
  _y = y;
  _z = z;
  _rZ = rZ;
  _rX = rX;
  _rY = rY;
  _slider1 = slider1;
  _slider2 = slider2;

  if (configuration.getAutoReport()) {
    sendReport();
  }
}

void BleController::setSimulationControls(int16_t rudder, int16_t throttle,
                                       int16_t accelerator, int16_t brake,
                                       int16_t steering) {
  if (rudder == -32768) {
    rudder = -32767;
  }
  if (throttle == -32768) {
    throttle = -32767;
  }
  if (accelerator == -32768) {
    accelerator = -32767;
  }
  if (brake == -32768) {
    brake = -32767;
  }
  if (steering == -32768) {
    steering = -32767;
  }

  _rudder = rudder;
  _throttle = throttle;
  _accelerator = accelerator;
  _brake = brake;
  _steering = steering;

  if (configuration.getAutoReport()) {
    sendReport();
  }
}

void BleController::setHats(signed char hat1, signed char hat2, signed char hat3,
                         signed char hat4) {
  _hat1 = hat1;
  _hat2 = hat2;
  _hat3 = hat3;
  _hat4 = hat4;

  if (configuration.getAutoReport()) {
    sendReport();
  }
}

void BleController::setSliders(int16_t slider1, int16_t slider2) {
  if (slider1 == -32768) {
    slider1 = -32767;
  }
  if (slider2 == -32768) {
    slider2 = -32767;
  }

  _slider1 = slider1;
  _slider2 = slider2;

  if (configuration.getAutoReport()) {
    sendReport();
  }
}

void BleController::sendReport(void) {
  if (this->isConnected()) {
    uint8_t currentReportIndex = 0;

    uint8_t m[hidReportSize];

    memset(&m, 0, sizeof(m));
    memcpy(&m, &_buttons, sizeof(_buttons));

    currentReportIndex += numOfButtonBytes;

    if (configuration.getTotalSpecialButtonCount() > 0) {
      m[currentReportIndex++] = _specialButtons;
    }

    if (configuration.getIncludeXAxis()) {
      m[currentReportIndex++] = _x;
      m[currentReportIndex++] = (_x >> 8);
    }
    if (configuration.getIncludeYAxis()) {
      m[currentReportIndex++] = _y;
      m[currentReportIndex++] = (_y >> 8);
    }
    if (configuration.getIncludeZAxis()) {
      m[currentReportIndex++] = _z;
      m[currentReportIndex++] = (_z >> 8);
    }
    if (configuration.getIncludeRzAxis()) {
      m[currentReportIndex++] = _rZ;
      m[currentReportIndex++] = (_rZ >> 8);
    }
    if (configuration.getIncludeRxAxis()) {
      m[currentReportIndex++] = _rX;
      m[currentReportIndex++] = (_rX >> 8);
    }
    if (configuration.getIncludeRyAxis()) {
      m[currentReportIndex++] = _rY;
      m[currentReportIndex++] = (_rY >> 8);
    }

    if (configuration.getIncludeSlider1()) {
      m[currentReportIndex++] = _slider1;
      m[currentReportIndex++] = (_slider1 >> 8);
    }
    if (configuration.getIncludeSlider2()) {
      m[currentReportIndex++] = _slider2;
      m[currentReportIndex++] = (_slider2 >> 8);
    }

    if (configuration.getIncludeRudder()) {
      m[currentReportIndex++] = _rudder;
      m[currentReportIndex++] = (_rudder >> 8);
    }
    if (configuration.getIncludeThrottle()) {
      m[currentReportIndex++] = _throttle;
      m[currentReportIndex++] = (_throttle >> 8);
    }
    if (configuration.getIncludeAccelerator()) {
      m[currentReportIndex++] = _accelerator;
      m[currentReportIndex++] = (_accelerator >> 8);
    }
    if (configuration.getIncludeBrake()) {
      m[currentReportIndex++] = _brake;
      m[currentReportIndex++] = (_brake >> 8);
    }
    if (configuration.getIncludeSteering()) {
      m[currentReportIndex++] = _steering;
      m[currentReportIndex++] = (_steering >> 8);
    }

    if (configuration.getIncludeGyroscope()) {
      m[currentReportIndex++] = _gX;
      m[currentReportIndex++] = (_gX >> 8);
      m[currentReportIndex++] = _gY;
      m[currentReportIndex++] = (_gY >> 8);
      m[currentReportIndex++] = _gZ;
      m[currentReportIndex++] = (_gZ >> 8);
    }

    if (configuration.getIncludeAccelerometer()) {
      m[currentReportIndex++] = _aX;
      m[currentReportIndex++] = (_aX >> 8);
      m[currentReportIndex++] = _aY;
      m[currentReportIndex++] = (_aY >> 8);
      m[currentReportIndex++] = _aZ;
      m[currentReportIndex++] = (_aZ >> 8);
    }

