black-ghost-off/ESP32-BLE-Controller/BleController.cpp
    if (configuration.getHatSwitchCount() > 0) {
      signed char hats[4];

      hats[0] = _hat1;
      hats[1] = _hat2;
      hats[2] = _hat3;
      hats[3] = _hat4;

      for (int currentHatIndex = configuration.getHatSwitchCount() - 1;
           currentHatIndex >= 0; currentHatIndex--) {
        m[currentReportIndex++] = hats[currentHatIndex];
      }
    }

#if BLE_GAMEPAD_DEBUG == 1
    dumpHIDReport(m, sizeof(m));
#endif

    this->inputController->setValue(m, sizeof(m));
    this->inputController->notify();
  }
}

void BleController::press(uint8_t b) {
  uint8_t index = (b - 1) / 8;
  uint8_t bit = (b - 1) % 8;
  uint8_t bitmask = (1 << bit);

  uint8_t result = _buttons[index] | bitmask;

  if (result != _buttons[index]) {
    _buttons[index] = result;
  }

  if (configuration.getAutoReport()) {
    sendReport();
  }
}

void BleController::release(uint8_t b) {
  uint8_t index = (b - 1) / 8;
  uint8_t bit = (b - 1) % 8;
  uint8_t bitmask = (1 << bit);

  uint64_t result = _buttons[index] & ~bitmask;

  if (result != _buttons[index]) {
    _buttons[index] = result;
  }

  if (configuration.getAutoReport()) {
    sendReport();
  }
}

uint8_t BleController::specialButtonBitPosition(uint8_t b) {
  if (b >= POSSIBLESPECIALBUTTONS)
    throw std::invalid_argument("Index out of range");
  uint8_t bit = 0;

  for (int i = 0; i < b; i++) {
    if (configuration.getWhichSpecialButtons()[i])
      bit++;
  }
  return bit;
}

void BleController::pressSpecialButton(uint8_t b) {
  uint8_t button = specialButtonBitPosition(b);
  uint8_t bit = button % 8;
  uint8_t bitmask = (1 << bit);

  uint64_t result = _specialButtons | bitmask;

  if (result != _specialButtons) {
    _specialButtons = result;
  }

  if (configuration.getAutoReport()) {
    sendReport();
  }
}

void BleController::releaseSpecialButton(uint8_t b) {
  uint8_t button = specialButtonBitPosition(b);
  uint8_t bit = button % 8;
  uint8_t bitmask = (1 << bit);

  uint64_t result = _specialButtons & ~bitmask;

  if (result != _specialButtons) {
    _specialButtons = result;
  }

  if (configuration.getAutoReport()) {
    sendReport();
  }
}

void BleController::pressStart() { pressSpecialButton(START_BUTTON); }

void BleController::releaseStart() { releaseSpecialButton(START_BUTTON); }

void BleController::pressSelect() { pressSpecialButton(SELECT_BUTTON); }

void BleController::releaseSelect() { releaseSpecialButton(SELECT_BUTTON); }

void BleController::pressMenu() { pressSpecialButton(MENU_BUTTON); }

void BleController::releaseMenu() { releaseSpecialButton(MENU_BUTTON); }

void BleController::pressHome() { pressSpecialButton(HOME_BUTTON); }

void BleController::releaseHome() { releaseSpecialButton(HOME_BUTTON); }

void BleController::pressBack() { pressSpecialButton(BACK_BUTTON); }

void BleController::releaseBack() { releaseSpecialButton(BACK_BUTTON); }

void BleController::pressVolumeInc() { pressSpecialButton(VOLUME_INC_BUTTON); }

void BleController::releaseVolumeInc() { releaseSpecialButton(VOLUME_INC_BUTTON); }

void BleController::pressVolumeDec() { pressSpecialButton(VOLUME_DEC_BUTTON); }

void BleController::releaseVolumeDec() { releaseSpecialButton(VOLUME_DEC_BUTTON); }

void BleController::pressVolumeMute() { pressSpecialButton(VOLUME_MUTE_BUTTON); }

void BleController::releaseVolumeMute() {
  releaseSpecialButton(VOLUME_MUTE_BUTTON);
}

void BleController::setLeftThumb(int16_t x, int16_t y) {
  if (x == -32768) {
    x = -32767;
  }
  if (y == -32768) {
    y = -32767;
  }

  _x = x;
  _y = y;

  if (configuration.getAutoReport()) {
    sendReport();
  }
}

void BleController::setRightThumb(int16_t z, int16_t rZ) {
  if (z == -32768) {
    z = -32767;
  }
  if (rZ == -32768) {
    rZ = -32767;
  }

  _z = z;
  _rZ = rZ;

  if (configuration.getAutoReport()) {
    sendReport();
  }
}

void BleController::setRightThumbAndroid(int16_t z, int16_t rX) {
  if (z == -32768) {
    z = -32767;
  }
  if (rX == -32768) {
    rX = -32767;
  }

  _z = z;
  _rX = rX;

  if (configuration.getAutoReport()) {
    sendReport();
  }
}

void BleController::setLeftTrigger(int16_t rX) {
  if (rX == -32768) {
    rX = -32767;
  }

  _rX = rX;

  if (configuration.getAutoReport()) {
    sendReport();
  }
}

void BleController::setRightTrigger(int16_t rY) {
  if (rY == -32768) {
    rY = -32767;
  }

  _rY = rY;

  if (configuration.getAutoReport()) {
    sendReport();
  }
}

void BleController::setTriggers(int16_t rX, int16_t rY) {
  if (rX == -32768) {
    rX = -32767;
  }
  if (rY == -32768) {
    rY = -32767;
  }

  _rX = rX;
  _rY = rY;

  if (configuration.getAutoReport()) {
    sendReport();
  }
}

void BleController::setHat(signed char hat) {
  _hat1 = hat;

  if (configuration.getAutoReport()) {
    sendReport();
  }
}

void BleController::setHat1(signed char hat1) {
  _hat1 = hat1;

  if (configuration.getAutoReport()) {
    sendReport();
  }
}

void BleController::setHat2(signed char hat2) {
  _hat2 = hat2;

  if (configuration.getAutoReport()) {
    sendReport();
  }
}

void BleController::setHat3(signed char hat3) {
  _hat3 = hat3;

  if (configuration.getAutoReport()) {
    sendReport();
  }
}

void BleController::setHat4(signed char hat4) {
  _hat4 = hat4;

  if (configuration.getAutoReport()) {
    sendReport();
  }
}

void BleController::setX(int16_t x) {
  if (x == -32768) {
    x = -32767;
  }

  _x = x;

  if (configuration.getAutoReport()) {
    sendReport();
  }
}

void BleController::setY(int16_t y) {
  if (y == -32768) {
    y = -32767;
  }

  _y = y;

  if (configuration.getAutoReport()) {
    sendReport();
  }
}

void BleController::setZ(int16_t z) {
  if (z == -32768) {
    z = -32767;
  }

  _z = z;

  if (configuration.getAutoReport()) {
    sendReport();
  }
}

void BleController::setRZ(int16_t rZ) {
  if (rZ == -32768) {
    rZ = -32767;
  }

  _rZ = rZ;

  if (configuration.getAutoReport()) {
    sendReport();
  }
}

void BleController::setRX(int16_t rX) {
  if (rX == -32768) {
    rX = -32767;
  }

  _rX = rX;

  if (configuration.getAutoReport()) {
    sendReport();
  }
}

void BleController::setRY(int16_t rY) {
  if (rY == -32768) {
    rY = -32767;
  }

