black-ghost-off/ESP32-BLE-Controller/BleController.cpp
  _rY = rY;

  if (configuration.getAutoReport()) {
    sendReport();
  }
}

void BleController::setSlider(int16_t slider) {
  if (slider == -32768) {
    slider = -32767;
  }

  _slider1 = slider;

  if (configuration.getAutoReport()) {
    sendReport();
  }
}

void BleController::setSlider1(int16_t slider1) {
  if (slider1 == -32768) {
    slider1 = -32767;
  }

  _slider1 = slider1;

  if (configuration.getAutoReport()) {
    sendReport();
  }
}

void BleController::setSlider2(int16_t slider2) {
  if (slider2 == -32768) {
    slider2 = -32767;
  }

  _slider2 = slider2;

  if (configuration.getAutoReport()) {
    sendReport();
  }
}

void BleController::setRudder(int16_t rudder) {
  if (rudder == -32768) {
    rudder = -32767;
  }

  _rudder = rudder;

  if (configuration.getAutoReport()) {
    sendReport();
  }
}

void BleController::setThrottle(int16_t throttle) {
  if (throttle == -32768) {
    throttle = -32767;
  }

  _throttle = throttle;

  if (configuration.getAutoReport()) {
    sendReport();
  }
}

void BleController::setAccelerator(int16_t accelerator) {
  if (accelerator == -32768) {
    accelerator = -32767;
  }

  _accelerator = accelerator;

  if (configuration.getAutoReport()) {
    sendReport();
  }
}

void BleController::setBrake(int16_t brake) {
  if (brake == -32768) {
    brake = -32767;
  }

  _brake = brake;

  if (configuration.getAutoReport()) {
    sendReport();
  }
}

void BleController::setSteering(int16_t steering) {
  if (steering == -32768) {
    steering = -32767;
  }

  _steering = steering;

  if (configuration.getAutoReport()) {
    sendReport();
  }
}

bool BleController::isPressed(uint8_t b) {
  uint8_t index = (b - 1) / 8;
  uint8_t bit = (b - 1) % 8;
  uint8_t bitmask = (1 << bit);

  if ((bitmask & _buttons[index]) > 0)
    return true;
  return false;
}

bool BleController::isConnected(void) { return this->connectionStatus->connected; }

void BleController::setBatteryLevel(uint8_t level) {
  this->batteryLevel = level;
  if (hid != 0) {

    this->hid->setBatteryLevel(this->batteryLevel,
                               this->isConnected() ? true : false);

    if (configuration.getAutoReport()) {
      sendReport();
    }
  }
}

bool BleController::isOutputReceived() {
  if (enableOutputReport && outputReceiver) {
    if (this->outputReceiver->outputFlag) {
      this->outputReceiver->outputFlag = false; // Clear Flag
      return true;
    }
  }
  return false;
}

uint8_t *BleController::getOutputBuffer() {
  if (enableOutputReport && outputReceiver) {
    memcpy(outputBackupBuffer, outputReceiver->outputBuffer,
           outputReportLength); // Creating a backup to avoid buffer being
                                // overwritten while processing data
    return outputBackupBuffer;
  }
  return nullptr;
}

bool BleController::deleteAllBonds(bool resetBoard) {
  bool success = false;

  NimBLEDevice::deleteAllBonds();
  NIMBLE_LOGD(LOG_TAG, "deleteAllBonds - All bonds deleted");
  success = true;
  delay(500);

  if (resetBoard) {
    NIMBLE_LOGD(LOG_TAG, "deleteAllBonds - Reboot ESP32");
    ESP.restart();
  }

  return success; // Returns false if all bonds are not deleted
}

bool BleController::deleteBond(bool resetBoard) {
  bool success = false;

  NimBLEServer *server = NimBLEDevice::getServer();

  if (server) {
    NimBLEConnInfo info = server->getPeerInfo(0);
    NimBLEAddress address = info.getAddress();

    success = NimBLEDevice::deleteBond(address);
    NIMBLE_LOGD(LOG_TAG, "deleteBond - Bond for %s deleted",
                std::string(address).c_str());

    delay(500);

    if (resetBoard) {
      NIMBLE_LOGD(LOG_TAG, "deleteBond - Reboot ESP32");
      ESP.restart();
    }
  }
  return success; // Returns false if current bond is not deleted
}

bool BleController::enterPairingMode() {
  NimBLEServer *server = NimBLEDevice::getServer();

  if (server) {
    NIMBLE_LOGD(LOG_TAG, "enterPairingMode - Pairing mode entered");

    // Get current connection information and address
    NimBLEConnInfo currentConnInfo = server->getPeerInfo(0);
    NimBLEAddress currentAddress = currentConnInfo.getAddress();
    NIMBLE_LOGD(LOG_TAG, "enterPairingMode - Connected Address: %s",
                std::string(currentAddress).c_str());

    // Disconnect from current connection
    for (uint16_t connHandle : server->getPeerDevices()) {
      server->disconnect(connHandle); // Disconnect the client
      NIMBLE_LOGD(LOG_TAG, "enterPairingMode - Disconnected from client");
      delay(500);
    }

    bool connectedToOldDevice = true;

    // While connected to old device, keep allowing to connect new new devices
    NIMBLE_LOGD(LOG_TAG, "enterPairingMode - Advertising for clients...");
    while (connectedToOldDevice) {
      delay(10); // Needs a delay to work - do not remove!

      if (this->isConnected()) {
        NimBLEConnInfo newConnInfo = server->getPeerInfo(0);
        NimBLEAddress newAddress = newConnInfo.getAddress();

        // Block specific MAC address
        if (newAddress == currentAddress) {
          NIMBLE_LOGD(LOG_TAG,
                      "enterPairingMode - Connected to previous client, so "
                      "disconnect and continue advertising for new client");
          server->disconnect(newConnInfo.getConnHandle());
          delay(500);
        } else {
          NIMBLE_LOGD(LOG_TAG, "enterPairingMode - Connected to new client");
          NIMBLE_LOGD(LOG_TAG, "enterPairingMode - Exit pairing mode");
          connectedToOldDevice = false;
          return true;
        }
      }
    }
    return false; // Might want to adjust this function to stay in pairing mode
                  // for a while, and then return false after a while if no
                  // other device pairs with it
  }
  return false;
}

NimBLEAddress BleController::getAddress() {
  NimBLEServer *server = NimBLEDevice::getServer();

  if (server) {
    // Get current connection information and address
    NimBLEConnInfo currentConnInfo = server->getPeerInfo(0);
    NimBLEAddress currentAddress = currentConnInfo.getAddress();
    return currentAddress;
  }
  NimBLEAddress blankAddress("00:00:00:00:00:00", 0);
  return blankAddress;
}

String BleController::getStringAddress() {
  NimBLEServer *server = NimBLEDevice::getServer();

  if (server) {
    // Get current connection information and address
    NimBLEConnInfo currentConnInfo = server->getPeerInfo(0);
    NimBLEAddress currentAddress = currentConnInfo.getAddress();
    return currentAddress.toString().c_str();
  }
  NimBLEAddress blankAddress("00:00:00:00:00:00", 0);
  return blankAddress.toString().c_str();
}

NimBLEConnInfo BleController::getPeerInfo() {
  NimBLEServer *server = NimBLEDevice::getServer();
  NimBLEConnInfo currentConnInfo = server->getPeerInfo(0);
  return currentConnInfo;
}

String BleController::getDeviceName() { return this->deviceName.c_str(); }

String BleController::getDeviceManufacturer() {
  return this->deviceManufacturer.c_str();
}

