black-ghost-off/ESP32-BLE-Controller/BleController.cpp
int8_t BleController::getTXPowerLevel() { return NimBLEDevice::getPower(); }

void BleController::setTXPowerLevel(int8_t level) {
  NimBLEDevice::setPower(
      level); // The only valid values are: -12, -9, -6, -3, 0, 3, 6 and 9
  configuration.setTXPowerLevel(level);
}

void BleController::setGyroscope(int16_t gX, int16_t gY, int16_t gZ) {
  if (gX == -32768) {
    gX = -32767;
  }

  if (gY == -32768) {
    gY = -32767;
  }

  if (gY == -32768) {
    gY = -32767;
  }

  _gX = gX;
  _gY = gY;
  _gZ = gZ;

  if (configuration.getAutoReport()) {
    sendReport();
  }
}

void BleController::setAccelerometer(int16_t aX, int16_t aY, int16_t aZ) {
  _aX = aX;
  _aY = aY;
  _aZ = aZ;

  if (configuration.getAutoReport()) {
    sendReport();
  }
}

void BleController::setMotionControls(int16_t gX, int16_t gY, int16_t gZ,
                                   int16_t aX, int16_t aY, int16_t aZ) {
  if (gX == -32768) {
    gX = -32767;
  }

  if (gY == -32768) {
    gY = -32767;
  }

  if (gZ == -32768) {
    gZ = -32767;
  }

  if (aX == -32768) {
    aX = -32767;
  }

  if (aY == -32768) {
    aY = -32767;
  }

  if (aZ == -32768) {
    aZ = -32767;
  }

  _gX = gX;
  _gY = gY;
  _gZ = gZ;
  _aX = aX;
  _aY = aY;
  _aZ = aZ;

  if (configuration.getAutoReport()) {
    sendReport();
  }
}

void BleController::setPowerStateAll(uint8_t batteryPowerInformation,
                                  uint8_t dischargingState,
                                  uint8_t chargingState, uint8_t powerLevel) {
  uint8_t powerStateBits = 0b00000000;

  _batteryPowerInformation = batteryPowerInformation;
  _dischargingState = dischargingState;
  _chargingState = chargingState;
  _powerLevel = powerLevel;

  // HID Battery Power State Bits:
  // Bits 0 and 1: Battery Power Information : 0(0b00) = Unknown, 1(0b01) = Not
  // Supported,  2(0b10) = Not Present,               3(0b11) = Present Bits 2
  // and 3: Discharging State         : 0(0b00) = Unknown, 1(0b01) = Not
  // Supported,  2(0b10) = Not Discharging,           3(0b11) = Discharging Bits
  // 4 and 5: Charging State            : 0(0b00) = Unknown, 1(0b01) = Not
  // Chargeable, 2(0b10) = Not Charging (Chargeable), 3(0b11) = Charging
  // (Chargeable) Bits 6 and 7: Power Level               : 0(0b00) = Unknown,
  // 1(0b01) = Not Supported,  2(0b10) = Good Level,                3(0b11) =
  // Critically Low Level

  powerStateBits |=
      (_batteryPowerInformation << 0); // Populate first 2 bits with data
  powerStateBits |=
      (_dischargingState << 2);            // Populate second 2 bits with data
  powerStateBits |= (_chargingState << 4); // Populate third 2 bits with data
  powerStateBits |= (_powerLevel << 6);    // Populate last 2 bits with data

  if (this->pCharacteristic_Power_State) {
    this->pCharacteristic_Power_State->setValue(&powerStateBits, 1);
    this->pCharacteristic_Power_State->notify();
  }
}

void BleController::setBatteryPowerInformation(uint8_t batteryPowerInformation) {
  _batteryPowerInformation = batteryPowerInformation;
  setPowerStateAll(_batteryPowerInformation, _dischargingState, _chargingState,
                   _powerLevel);
}

void BleController::setDischargingState(uint8_t dischargingState) {
  _dischargingState = dischargingState;
  setPowerStateAll(_batteryPowerInformation, _dischargingState, _chargingState,
                   _powerLevel);
}

void BleController::setChargingState(uint8_t chargingState) {
  _chargingState = chargingState;
  setPowerStateAll(_batteryPowerInformation, _dischargingState, _chargingState,
                   _powerLevel);
}

void BleController::setPowerLevel(uint8_t powerLevel) {
  _powerLevel = powerLevel;
  setPowerStateAll(_batteryPowerInformation, _dischargingState, _chargingState,
                   _powerLevel);
}

#if BLE_GAMEPAD_DEBUG == 1
static void dumpHidReportDescriptor(const uint8_t *desc, size_t size) {
  if (!Serial) {
    // Serial not initialized yet, avoid printing
    return;
  }

  if (desc == nullptr || size == 0) {
    Serial.println(
        "[BleController][ERROR] HID Report Descriptor is null or empty!");
    return;
  }

  Serial.printf("[BleController][INFO] HID Report Descriptor size: %u bytes\n",
                (unsigned)size);
  for (size_t i = 0; i < size; i++) {
    if (i % 16 == 0) {
      Serial.printf("\n%03u: ", (unsigned)i);
    }
    Serial.printf("%02X ", desc[i]);
  }
  Serial.println("\n[BleController][INFO] End of HID Report Descriptor");

  Serial.printf("\n\nCopy start under here\n");
  for (size_t i = 0; i < size; i++) {
    if (i % 16 == 0) {
      Serial.printf("\n");
    }
    Serial.printf("%02X ", desc[i]);
  }
  Serial.println("\nCopy end above here ");
  Serial.println("\n\nCopy and paste the output above and use a parser such as "
                 "at https://eleccelerator.com/usbdescreqparser to create a "
                 "readable HID Report Descriptor\n\n");
}

static void dumpHIDReport(const uint8_t *report, size_t size) {
  if (!Serial) {
    // Serial not initialized yet, avoid printing
    return;
  }

  Serial.printf("[BleController][INFO] HID Report Dump size: %u bytes\n",
                (unsigned)size);
  for (size_t i = 0; i < size; i++) {
    Serial.printf("%02X ", report[i]);
    // Optional: break line every 16 bytes
    if ((i + 1) % 16 == 0)
      Serial.println();
  }
  Serial.println();
  Serial.println("\n[BleController][INFO] End of HID Report Dump");
}
#endif

void BleController::beginNUS() {
  if (!this->nusInitialized) {
    // Extrememly important to make sure that the pointer to server is actually
    // valid
    while (!NimBLEDevice::isInitialized()) {
    } // Wait until the server is initialized
    while (NimBLEDevice::getServer() == nullptr) {
    } // Ensure pointer to server is actually valid

    // Now server is nkown to be valid, initialise nus to new BleNUS instance
    nus = new BleNUS(NimBLEDevice::getServer()); // Pass the existing BLE server
    nus->begin();
    nusInitialized = true;
  }
}

BleNUS *BleController::getNUS() {
  return nus; // Return a pointer instead of a reference
}

void BleController::sendDataOverNUS(const uint8_t *data, size_t length) {
  if (nus) {
    nus->sendData(data, length);
  }
}

void BleController::setNUSDataReceivedCallback(
    void (*callback)(const uint8_t *data, size_t length)) {
  if (nus) {
    nus->setDataReceivedCallback(callback);
  }
}

