black-ghost-off/ESP32-BLE-Controller/BleController.cpp
void BleController::taskServer(void *pvParameter) {
  BleController *BleControllerInstance =
      (BleController *)pvParameter; // static_cast<BleController *>(pvParameter);

  NimBLEDevice::init(BleControllerInstance->deviceName);
  NimBLEDevice::setPower(
      BleControllerInstance->configuration
          .getTXPowerLevel()); // Set transmit power for advertising (Range: -12
                               // to +9 dBm)
  NimBLEServer *pServer = NimBLEDevice::createServer();
  pServer->setCallbacks(BleControllerInstance->connectionStatus);
  pServer->advertiseOnDisconnect(true);

  BleControllerInstance->hid = new NimBLEHIDDevice(pServer);

  BleControllerInstance->inputController = BleControllerInstance->hid->getInputReport(
      BleControllerInstance->configuration
          .getHidReportId()); // <-- input REPORTID from report map
  BleControllerInstance->connectionStatus->inputController =
      BleControllerInstance->inputController;

  // Initialize keyboard and mouse input characteristics
  BleControllerInstance->inputKeyboard =
      BleControllerInstance->hid->getInputReport(KEYBOARD_REPORT_ID);
  BleControllerInstance->inputMouse =
      BleControllerInstance->hid->getInputReport(MOUSE_REPORT_ID);

  if (BleControllerInstance->enableOutputReport) {
    BleControllerInstance->outputGamepad =
        BleControllerInstance->hid->getOutputReport(
            BleControllerInstance->configuration.getHidReportId());
    BleControllerInstance->outputReceiver =
        new BleOutputReceiver(BleControllerInstance->outputReportLength);
    BleControllerInstance->outputBackupBuffer =
        new uint8_t[BleControllerInstance->outputReportLength];
    BleControllerInstance->outputGamepad->setCallbacks(
        BleControllerInstance->outputReceiver);
  }

  BleControllerInstance->hid->setManufacturer(
      BleControllerInstance->deviceManufacturer);

  NimBLEService *pService =
      pServer->getServiceByUUID(SERVICE_UUID_DEVICE_INFORMATION);

  BLECharacteristic *pCharacteristic_Model_Number =
      pService->createCharacteristic(CHARACTERISTIC_UUID_MODEL_NUMBER,
                                     NIMBLE_PROPERTY::READ);
  pCharacteristic_Model_Number->setValue(
      std::string(BleControllerInstance->configuration.getModelNumber()));

  BLECharacteristic *pCharacteristic_Software_Revision =
      pService->createCharacteristic(CHARACTERISTIC_UUID_SOFTWARE_REVISION,
                                     NIMBLE_PROPERTY::READ);
  pCharacteristic_Software_Revision->setValue(
      std::string(BleControllerInstance->configuration.getSoftwareRevision()));

  BLECharacteristic *pCharacteristic_Serial_Number =
      pService->createCharacteristic(CHARACTERISTIC_UUID_SERIAL_NUMBER,
                                     NIMBLE_PROPERTY::READ);
  pCharacteristic_Serial_Number->setValue(
      std::string(BleControllerInstance->configuration.getSerialNumber()));

  BLECharacteristic *pCharacteristic_Firmware_Revision =
      pService->createCharacteristic(CHARACTERISTIC_UUID_FIRMWARE_REVISION,
                                     NIMBLE_PROPERTY::READ);
  pCharacteristic_Firmware_Revision->setValue(
      std::string(BleControllerInstance->configuration.getFirmwareRevision()));

  BLECharacteristic *pCharacteristic_Hardware_Revision =
      pService->createCharacteristic(CHARACTERISTIC_UUID_HARDWARE_REVISION,
                                     NIMBLE_PROPERTY::READ);
  pCharacteristic_Hardware_Revision->setValue(
      std::string(BleControllerInstance->configuration.getHardwareRevision()));

  NimBLECharacteristic *pCharacteristic_Power_State =
      BleControllerInstance->hid->getBatteryService()->createCharacteristic(
          CHARACTERISTIC_UUID_BATTERY_POWER_STATE,
          NIMBLE_PROPERTY::READ | NIMBLE_PROPERTY::NOTIFY);
  BleControllerInstance->pCharacteristic_Power_State =
      pCharacteristic_Power_State; // Assign the created characteristic
  BleControllerInstance->pCharacteristic_Power_State->setValue(
      0b00000000); // Now it's safe to call setValue <- Set all to unknown by
                   // default

  BleControllerInstance->hid->setPnp(
      0x01, BleControllerInstance->configuration.getVid(),
      BleControllerInstance->configuration.getPid(),
      BleControllerInstance->configuration.getGuidVersion());
  BleControllerInstance->hid->setHidInfo(0x00, 0x01);

  // NimBLEDevice::setSecurityAuth(BLE_SM_PAIR_AUTHREQ_BOND);
  NimBLEDevice::setSecurityAuth(true, false,
                                false); // enable bonding, no MITM, no SC

  uint8_t *customHidReportDescriptor =
      new uint8_t[BleControllerInstance->hidReportDescriptorSize];
  memcpy(customHidReportDescriptor, BleControllerInstance->tempHidReportDescriptor,
         BleControllerInstance->hidReportDescriptorSize);

#if BLE_GAMEPAD_DEBUG == 1
  // Print HidReportDescriptor to Serial
  dumpHidReportDescriptor(BleControllerInstance->tempHidReportDescriptor,
                          BleControllerInstance->hidReportDescriptorSize);
#endif

  BleControllerInstance->hid->setReportMap(
      (uint8_t *)customHidReportDescriptor,
      BleControllerInstance->hidReportDescriptorSize);
  BleControllerInstance->hid->startServices();

  BleControllerInstance->onStarted(pServer);

  NimBLEAdvertising *pAdvertising = pServer->getAdvertising();
  pAdvertising->setAppearance(HID_GAMEPAD);
  pAdvertising->setName(BleControllerInstance->deviceName);
  pAdvertising->addServiceUUID(
      BleControllerInstance->hid->getHidService()->getUUID());

  if (BleControllerInstance->delayAdvertising) {
    NIMBLE_LOGD(LOG_TAG, "Main NimBLE server advertising delayed (until Nordic "
                         "UART Service added)");
  } else {
    NIMBLE_LOGD(LOG_TAG, "Main NimBLE server advertising started!");
    pAdvertising->start();
  }

  BleControllerInstance->hid->setBatteryLevel(BleControllerInstance->batteryLevel);

  vTaskDelay(portMAX_DELAY); // delay(portMAX_DELAY);
}

// ===================== KEYBOARD METHODS =====================

void BleController::keyboardPress(uint8_t key) {
  if (!this->isConnected())
    return;

