black-ghost-off/ESP32-BLE-Controller/BleController.cpp
  // Add key to the report if not already present
  for (int i = 0; i < 6; i++) {
    if (_keyboardReport.keys[i] == key) {
      return; // Key already pressed
    }
    if (_keyboardReport.keys[i] == 0) {
      _keyboardReport.keys[i] = key;
      break;
    }
  }
  sendKeyboardReport();
}

void BleController::keyboardRelease(uint8_t key) {
  if (!this->isConnected())
    return;

  // Remove key from the report
  for (int i = 0; i < 6; i++) {
    if (_keyboardReport.keys[i] == key) {
      _keyboardReport.keys[i] = 0;
      // Shift remaining keys down
      for (int j = i; j < 5; j++) {
        _keyboardReport.keys[j] = _keyboardReport.keys[j + 1];
      }
      _keyboardReport.keys[5] = 0;
      break;
    }
  }
  sendKeyboardReport();
}

void BleController::keyboardReleaseAll() {
  if (!this->isConnected())
    return;

  memset(&_keyboardReport, 0, sizeof(_keyboardReport));
  sendKeyboardReport();
}

void BleController::keyboardWrite(uint8_t key) {
  keyboardPress(key);
  delay(10);
  keyboardRelease(key);
}

void BleController::keyboardWrite(const char *str) {
  if (!this->isConnected())
    return;

  for (int i = 0; str[i] != '\0'; i++) {
    char c = str[i];
    uint8_t hidKey = asciiToHID(c);

    if (hidKey != 0) {
      if (needsShift(c)) {
        _keyboardReport.modifiers |= KEY_MOD_LSHIFT;
      }

      _keyboardReport.keys[0] = hidKey;
      sendKeyboardReport();
      delay(10);

      // Release key and modifier
      _keyboardReport.keys[0] = 0;
      _keyboardReport.modifiers = 0;
      sendKeyboardReport();
      delay(10);
    }
  }
}

void BleController::keyboardPrint(const char *str) { keyboardWrite(str); }

void BleController::keyboardPrint(String str) { keyboardWrite(str.c_str()); }

void BleController::setKeyboardModifiers(uint8_t modifiers) {
  _keyboardReport.modifiers = modifiers;
}

void BleController::sendKeyboardReport() {
  if (!this->isConnected())
    return;

  uint8_t report[9];
  report[0] = KEYBOARD_REPORT_ID;
  report[1] = _keyboardReport.modifiers;
  report[2] = _keyboardReport.reserved;
  memcpy(&report[3], _keyboardReport.keys, 6);

  this->inputKeyboard->setValue(report, sizeof(report));
  this->inputKeyboard->notify();

#if BLE_GAMEPAD_DEBUG == 1
  dumpHIDReport(report, sizeof(report));
#endif
}

void BleController::rawKeyboardAction(uint8_t msg[], char msgSize) {
  if (!this->isConnected())
    return;

  this->inputKeyboard->setValue(msg, msgSize);
  this->inputKeyboard->notify();

#if BLE_GAMEPAD_DEBUG == 1
  dumpHIDReport(msg, msgSize);
#endif
}

// ===================== MOUSE METHODS =====================

void BleController::mouseClick(uint8_t button) {
  mousePress(button);
  delay(10);
  mouseRelease(button);
}

void BleController::mousePress(uint8_t button) {
  if (!this->isConnected())
    return;

  _mouseReport.buttons |= button;
  sendMouseReport();
}

void BleController::mouseRelease(uint8_t button) {
  if (!this->isConnected())
    return;

  _mouseReport.buttons &= ~button;
  sendMouseReport();
}

void BleController::mouseReleaseAll() {
  if (!this->isConnected())
    return;

  _mouseReport.buttons = 0;
  sendMouseReport();
}

void BleController::mouseMove(int8_t x, int8_t y) {
  if (!this->isConnected())
    return;

  _mouseReport.x = x;
  _mouseReport.y = y;
  sendMouseReport();

  // Reset movement after sending
  _mouseReport.x = 0;
  _mouseReport.y = 0;
}

void BleController::mouseScroll(int8_t scroll) {
  if (!this->isConnected())
    return;

  _mouseReport.wheel = scroll;
  sendMouseReport();

  // Reset scroll after sending
  _mouseReport.wheel = 0;
}

void BleController::sendMouseReport() {
  if (!this->isConnected())
    return;

  uint8_t report[5];
  report[0] = MOUSE_REPORT_ID;
  report[1] = _mouseReport.buttons;
  report[2] = _mouseReport.x;
  report[3] = _mouseReport.y;
  report[4] = _mouseReport.wheel;

  this->inputMouse->setValue(report, sizeof(report));
  this->inputMouse->notify();

#if BLE_GAMEPAD_DEBUG == 1
  dumpHIDReport(report, sizeof(report));
#endif
}

void BleController::rawMouseAction(uint8_t msg[], char msgSize) {
  if (!this->isConnected())
    return;

  this->inputMouse->setValue(msg, msgSize);
  this->inputMouse->notify();

#if BLE_GAMEPAD_DEBUG == 1
  dumpHIDReport(msg, msgSize);
#endif
}

// ASCII to HID scan code conversion for printable characters
uint8_t asciiToHID(char ascii) {
  if (ascii >= 'a' && ascii <= 'z') {
    return ascii - 'a' + 0x04; // a-z -> 0x04-0x1D
  }
  if (ascii >= 'A' && ascii <= 'Z') {
    return ascii - 'A' + 0x04; // A-Z -> 0x04-0x1D (same as lowercase, shift
                               // handled by modifier)
  }
  if (ascii >= '1' && ascii <= '9') {
    return ascii - '1' + 0x1E; // 1-9 -> 0x1E-0x26
  }

  switch (ascii) {
  case '0':
    return 0x27;
  case ' ':
    return 0x2C; // Space
  case '-':
    return 0x2D; // Minus
  case '=':
    return 0x2E; // Equal
  case '[':
    return 0x2F; // Left bracket
  case ']':
    return 0x30; // Right bracket
  case '\\':
    return 0x31; // Backslash
  case ';':
    return 0x33; // Semicolon
  case '\'':
    return 0x34; // Apostrophe
  case '`':
    return 0x35; // Grave accent
  case ',':
    return 0x36; // Comma
  case '.':
    return 0x37; // Period
  case '/':
    return 0x38; // Slash
  case '\n':
    return KEY_RETURN;
  case '\r':
    return KEY_RETURN;
  case '\t':
    return KEY_TAB;
  case '\b':
    return KEY_BACKSPACE;
  default:
    return 0x00; // No key
  }
}

// Check if character needs shift modifier
bool needsShift(char ascii) {
  return (ascii >= 'A' && ascii <= 'Z') || ascii == '!' || ascii == '@' ||
         ascii == '#' || ascii == '$' || ascii == '%' || ascii == '^' ||
         ascii == '&' || ascii == '*' || ascii == '(' || ascii == ')' ||
         ascii == '_' || ascii == '+' || ascii == '{' || ascii == '}' ||
         ascii == '|' || ascii == ':' || ascii == '"' || ascii == '<' ||
         ascii == '>' || ascii == '?';
}